Revit.Elements.Wall.#ctor(Autodesk.Revit.DB.Wall)
Create from an existing Revit Element
wall:

Revit.Elements.Wall.#ctor(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.WallType,Autodesk.Revit.DB.Level,System.Double,System.Double,System.Boolean,System.Boolean)
Create a new instance of WallType, deleting the original
curve:
wallType:
baseLevel:
height:
offset:
flip:
isStructural:

Revit.Elements.Wall.InitWall(Autodesk.Revit.DB.Wall)
Initialize a Wall element
wall:

Revit.Elements.Wall.InitWall(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.WallType,Autodesk.Revit.DB.Level,System.Double,System.Double,System.Boolean,System.Boolean)
Initialize a Wall element
curve:
wallType:
baseLevel:
height:
offset:
flip:
isStructural:

Revit.Elements.Wall.InternalSetWall(Autodesk.Revit.DB.Wall)
Set the internal Element, ElementId, and UniqueId
wall:

Revit.Elements.Wall.ByCurveAndHeight(Autodesk.DesignScript.Geometry.Curve,System.Double,Revit.Elements.Level,Revit.Elements.WallType)
Create a Revit Wall from a guiding Curve, height, Level, and WallType
curve:
height:
level:
wallType:
Returns:

Revit.Elements.Wall.ByCurveAndLevels(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Revit.Elements.Level,Revit.Elements.WallType)
Create a Revit Wall from a guiding Curve, start Level, end Level, and WallType
c:
startLevel:
endLevel:
wallType:
Returns:

Revit.Elements.Wall.FromExisting(Autodesk.Revit.DB.Wall,System.Boolean)
Create a Revit Wall from an existing reference
wall:
isRevitOwned:
Returns:

Revit.Elements.Wall.InternalWall
Internal reference to the Revit Element

Revit.Elements.Wall.InternalElement
Reference to the Element